Revit 2027 API
BreakPatternCondition Enumeration
 Condition on which patterns distribution will be broken.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BreakPatternCondition
Public Enumeration BreakPatternCondition
public enum class BreakPatternCondition
type BreakPatternCondition
Members
Member name | Value | Description
AnglesGreaterThan | 1 |  Patterns distribution is broken if the angle between neighboring path segments is greater than the defined.
EachSegmentEnd | 0 |  Patterns distribution is broken at each segment end.
Never | 2 |  Patterns are distributed along whole path of a railing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace